// აპლიკაცია: ბანკომატი
// ბანკომატის აპლიკაცია საშუალებას აძლევს მომხმარებელს განახორციელოს ბანკომატის ძირითადი ოპერაციების სიმულაცია. მომხმარებელს შეუძლია შეასრულოს ისეთი ქმედებები, როგორიცაა ბალანსის შემოწმება, თანხის შეტანა და თანხის გატანა. მომხმარებლის მონაცემები ინახება წინასწარ გამზადებულ ორგანზომილებიან მასივში მომხმარებლის ანგარიშის ინფორმაციის შესანარჩუნებლად.

//თავდაპირველად შევქმენი მომხმარებლების ანგარიშის ნომრის, პინ კოდისა და პირველი ბალანსის შემცველი ცვლადები, რომლებიც შემდგომ შევინახე ორგანზომილებიან მასივში.
const accNum1 = 111222333;
const password1 = 2005;
let balance1 = 1500;

const accNum2 = 444555666;
const password2 = 1995;
let balance2 = 7800;

const accNum3 = 777888999;
const password3 = 1975;
let balance3 = 2500;

let userAccounts = [
  [accNum1, password1, balance1],
  [accNum2, password2, balance2],
  [accNum3, password3, balance3],
];
let accNumAttempt = 3;
let pinAttempt = 3;
let balance;

//ფუნქცია login() ამოწმებს მომხმარებლის მიერ შეყვანილი მონაცემები ემთხვევა თუ არა მასივში მყოფ მონაცემებს.
function login() {
  //თავიდანვე ვქმნი ორ ცვლადს მომხმარებლის ანგარიშის ნომრისა და პინ კოდის შეყვანის შემდგომ შესამოწმებლად
  let accNumEntered = false;
  let pinEntered = false;
  // აქვე while loop ში ვახდენ მთელი ფუნქციის მუშაობას და ანგარიშის ნომრის მცდელობების შემოწმებას
  while (!accNumEntered && accNumAttempt > 0) {
    const accNum = Number(prompt("შეიყვანეთ ანგარიშის ნომერი:"));
    //for loopში ხდება ჩვენი თავდაპირველი მასივის მნიშვნელობების შედარება მომხმარებლის მიერ შეყვანილ მონაცემებთან
    for (let i of userAccounts) {
      if (i[0] === accNum) {
        accNumEntered = true;
        //მოცემულ while loopში ხდება უკვე პინ კოდის მცდელობების შემოწმება და ამის შემდეგ atm() ფუნქციაზე გადასვლა, რომელიც ბანკომატის ფუნქციონალს ემსახურება
        while (!pinEntered && pinAttempt > 0) {
          const pin = Number(prompt("შეიყვანეთ PIN კოდი:"));
          if (i[1] === pin) {
            pinEntered = true;
            balance = i[2];
            atm();
          } else {
            pinAttempt--;
            //მომხმარებლის მიერ შეყვანილი ანგარიშის ნომრის მცდელობების რაოდენობების ასახვა
            if (pinAttempt > 0) {
              alert(`არასწორად შეყვანილი PIN. ${pinAttempt} მცდელობა დარჩა.`);
            } else {
              alert(
                "დაფიქსირებულია 3-ჯერ არასწორად შეყვანილი PIN კოდი. თქვენი ანგარიში დაბლოკილია."
              );
              return;
            }
          }
        }
      }
    }
    //მომხმარებლის მიერ შეყვანილი პინ კოდის მცდელობების რაოდენობის ასახვა
    if (!accNumEntered) {
      attempt1--;
      if (attempt1 > 0) {
        alert(
          `არასწორად შეყვანილი ანგარიშის ნომერი. ${attempt1} მცდელობა დარჩა.`
        );
      } else {
        alert(
          "დაფიქსირებულია 3-ჯერ არასწორად შეყვანილი ანგარიშის ნომერი. თქვენი ანგარიში დაბლოკილია."
        );
        return;
      }
    }
  }
}
//აქ ხდება ამ ფუნქციის გაშვება
login();

//ფუნქცია atm() შეიცავს მთლიანი ბანკომატის ფუნქციონალს. აქ ხდება მომხმარებლის ბალანსის შემოწმება, თანხის შეტანა და გამოტანა.
function atm() {
  let choice = Number(
    prompt(
      "გთხოვთ, აირჩიეთ სასურველი ოპერაცია:\n1.ბალანსის შემოწმება\n2.თანხის შეტანა\n3.თანხის გამოტანა\n4.გამოსვლა"
    )
  );
  //აქ ხდება მომხმარებლის არჩევნის შემოწმება და მათ თაობაზე შესაბამისი ოპერაციის შესრულება
  if (choice === 1) {
    balanceCheck();
  } else if (choice === 2) {
    deposit();
  } else if (choice === 3) {
    withdraw();
  } else if (choice === 4) {
    exit();
  } else {
    alert("არასწორი იდენტიფიკატორი");
    atm();
  }
}
//ბალანსის შემოწმების ფუნქცია
function balanceCheck() {
  alert(`თქვენს ანგარიშზე ${balance} ლარია`);
  atm();
}
//თანხის შეტანის ფუნქცია
function deposit() {
  let amount = Number(prompt("რამდენი ლარის გამოტანა გნებავთ?"));
  balance += amount;
  alert(
    `თქვენ წარმატებით გამოიტანეთ ${amount} ლარი. თქვენს ანგარიშზე ${balance} ლარია`
  );
  atm();
}
//თანხის განაღდების ფუნქცია
function withdraw() {
  let amount = Number(prompt("რამდენი ლარის გამოტანა გნებავთ?"));

  if (amount > balance) {
    alert("ბალანსზე არასაკმარისი თანხაა");
    withdraw();
  } else {
    balance -= amount;
    alert(
      `თქვენ წარმატებით გამოიტანეთ ${amount} ლარი. თქვენს ანგარიშზე ${balance} ლარია`
    );
    atm();
  }
}
//ბანკომატიდან გამოსვლის ფუნქცია
function exit() {
  alert("გმადლობთ, რომ გვეწვიეთ.");
  login();
}
